In [1]:
import pandas as pd
import numpy as np

In [5]:
# a - Map

In [2]:
s = pd.Series(['cat','dog',np.nan,'rabbit'])

In [3]:
s

0       cat
1       dog
2       NaN
3    rabbit
dtype: object

In [4]:
s.map({'cat':'kitten', 'dog':'puppy'})

0    kitten
1     puppy
2       NaN
3       NaN
dtype: object

In [7]:
s.map('I am a {}'.format,na_action='ignore')

0       I am a cat
1       I am a dog
2              NaN
3    I am a rabbit
dtype: object

In [8]:
#b - Apply

In [9]:
s = pd.Series([20,21,22],index=['London','New York','Helsinki'])

In [10]:
s.apply(lambda x: x**2)

London      400
New York    441
Helsinki    484
dtype: int64

In [18]:
 df = pd.DataFrame(np.random.randint(10,size=(5,2)),columns=range(2),index=range(5))

In [19]:
df.apply(lambda x:x**2)

    0   1
0  16   9
1  25   4
2  64   0
3  64   9
4  49  49

In [20]:
df

   0  1
0  4  3
1  5  2
2  8  0
3  8  3
4  7  7